"Presidential elections were held on Tuesday, November 7, 1944. The election took place during World War II, which ended the following year. Incumbent Democratic President Franklin D. Roosevelt defeated Republican Thomas E. Dewey to win an unprecedented fourth term. It was also the fifth presidential election in which both major party candidates were registered in the same home state; the others have been in 1860, 1904, 1920, 1940, and 2016. Though the margin of victory was still a landslide, this was Roosevelt's weakest performance in his four elections, and the popular vote split was less lopsided.\nRoosevelt had become the first president to win a third term with his victory in the 1940 presidential election, with little doubt that he would seek a fourth term. Unlike in 1940, Roosevelt faced little opposition within his own party, and he easily won the presidential nomination of the 1944 Democratic National Convention. Concerned that Roosevelt's ill health would mean the vice president would likely become president, the convention dropped Roosevelt's vice president Henry A. Wallace in favor of the lesser known Senator Harry S. Truman of Missouri. Governor Dewey of New York emerged as the front-runner for the Republican nomination after his victory in the Wisconsin primary, and he defeated conservative Governor John W. Bricker at the 1944 Republican National Convention.\nAs World War II was going well for the United States and the Allies, Roosevelt remained popular despite his long tenure. Dewey campaigned against the New Deal and for a smaller government, but was ultimately unsuccessful in convincing the country to change course. The election was closer than Roosevelt's other presidential campaigns, but Roosevelt still won by a 7.5 percentage point margin in the popular vote and by a wide margin in the Electoral College. Rumors of Roosevelt's ill health, although somewhat dispelled by his vigorous campaigning, proved to be prescient; Roosevelt died less than three months into his fourth term and was succeeded by Truman."