"Presidential elections were held in the United States on November 2, 1948. Incumbent Democratic President Harry S. Truman defeated heavily favored Republican New York Governor Thomas E. Dewey, and third-party candidates, in one of the greatest election upsets in American history.\nTruman had been elected vice president in the 1944 election, and succeeded to the presidency in April 1945 upon the death of Franklin D. Roosevelt. He won his party's nomination at the 1948 Democratic National Convention only after defeating attempts to drop him from the ticket. The convention's civil rights plank caused a walkout by several Southern delegates, who launched a third-party \"States' Rights Democratic Party\" ticket, more commonly known as the Dixiecrats, led by South Carolina Governor Strom Thurmond. The Dixiecrats hoped to win enough electoral votes to force a contingent election in the House of Representatives, where they could extract concessions from either Dewey or Truman in exchange for their support. Former vice president Henry A. Wallace also challenged Truman by launching the Progressive Party and criticizing his confrontational Cold War policies. Dewey, the leader of his party's liberal eastern wing and the 1944 Republican presidential nominee, defeated conservative Ohio Senator Robert A. Taft and other challengers at the 1948 Republican National Convention. This was the first election to have primary and general election debates, with Dewey debating Harold Stassen in the Republican primary, while Norman Thomas debated Farrell Dobbs in the general election.\nTruman's feisty campaign style energized his base of traditional Democrats, consisting of most of the white South, as well as labor unions, and Catholic and Jewish voters; he also fared surprisingly well with Midwestern farmers. Dewey ran a low-risk campaign and avoided directly criticizing Truman. With the three-way split in the Democratic Party, and with Truman's low approval ratings, Truman was widely considered to be the underdog in the race, and virtually every prediction (with or without public opinion polls) indicated Dewey would win the election. Defying these predictions, Truman won the election with 303 electoral votes to Dewey's 189. Truman also won 49.6% of the popular vote compared to Dewey's 45.1%, while the third-party candidacies of Thurmond and Wallace each won less than 3% of the popular vote, with Thurmond carrying four southern states in the Deep South. Truman became the third president to be elected to a full term after succeeding to the presidency upon his predecessor's death.\nTruman's surprise victory was the fifth consecutive presidential win for the Democratic Party, the longest winning streak for the Democrats, and the longest for either party since the 1880 election. With simultaneous success in the 1948 congressional elections, the Democrats regained control of both houses of Congress, which they had lost in 1946. Thus, Truman's election confirmed the Democratic Party's status as the nation's majority party. This was the last presidential election before the ratification of the 22nd Amendment in 1951, which would establish term limits for a president. This did not apply to the incumbent Truman, but as he chose not to run in 1952, this was the last presidential election with no future disqualification effect for second-term winners."