"Presidential elections were held in the United States on November 4, 1952. Republican nominee Dwight D. Eisenhower defeated Democratic Illinois Governor Adlai Stevenson II in a landslide victory, becoming the first Republican president in 20 years. This was the first election since 1928 without an incumbent president on the ballot.\n\nStevenson emerged victorious on the third presidential ballot of the 1952 Democratic National Convention by defeating Tennessee Senator Estes Kefauver, Georgia Senator Richard Russell Jr., and other candidates. The Republican nomination was primarily contested by Eisenhower, a general, widely popular for his leadership in World War II, and the conservative Ohio Senator Robert A. Taft. With the support of Thomas E. Dewey and other party leaders, Eisenhower narrowly prevailed over Taft at the 1952 Republican National Convention. He selected youthful California Senator Richard Nixon as his running mate. In the first televised presidential campaign, Eisenhower was charismatic and very well known, in sharp contrast to Stevenson.\nRepublicans attacked President Harry S. Truman's handling of the Korean War and the broader Cold War, alleging Soviet spies infiltrated the U.S. government. Democrats faulted Eisenhower for failing to condemn Senators Joseph McCarthy, William E. Jenner, and other reactionary Republicans, who, the Democrats alleged, engaged in reckless and unwarranted attacks. Stevenson tried to separate himself from the unpopular Truman administration. Instead, he campaigned on the popularity of the New Deal and stoked fears of another Great Depression under a Republican administration.\nEisenhower retained his enormous popularity from the war, as was seen in his campaign slogan, \"I Like Ike\". Eisenhower's public support, coupled with the unpopularity of Truman, allowed him to win comfortably with 55.18% of the popular vote and carry every state outside of the South; he even managed to carry Virginia, Tennessee, Florida, and Texas, Southern states that voted for Democrats since the end of Reconstruction, with the exception of 1928 (Tennessee also voted Republican in 1920).  Eisenhower received over 34 million votes, which at the time was the largest share of the popular vote a presidential candidate had received, surpassing Franklin D. Roosevelt's record in 1936. Republicans gained among Democrats, especially urban and suburban Southerners, and White ethnic groups in the Northeast and Midwest."