"Presidential elections were held in the United States on November 6, 1956. Incumbent Republican President Dwight D. Eisenhower and his running mate, incumbent Vice President Richard Nixon, were reelected, defeating Democrat Adlai Stevenson II, former Illinois governor, in a rematch of 1952.\nEisenhower, who first became famous for his military leadership in World War II, remained widely popular. A heart attack in 1955 provoked speculation that he would not seek a second term, but his health recovered and he faced no opposition at the 1956 Republican National Convention. Stevenson remained popular with a core of liberal Democrats, but held no office and had no real base. He defeated New York Governor W. Averell Harriman and several other candidates on the first presidential ballot of the 1956 Democratic National Convention. Stevenson called for a significant increase in government spending on social programs and a decrease in military spending.\nWith the end of the Korean War and a strong economy, Eisenhower was the heavy favorite to win reelection. Supporters of the president focused on his \"personal qualities ... his sincerity, his integrity and sense of duty, his virtue as a family man, his religious devotion, and his sheer likeableness\", rather than on his leadership record. The weeks before the election saw two major international crises in the Middle East and Eastern Europe, and Eisenhower's handling of the crises boosted his popularity.\nEisenhower slightly improved on his 1952 majorities in both the popular and electoral vote. He increased his 1952 gains among Democrats, especially Northern and Midwestern white ethnic groups and city-dwelling and suburban White Southerners. Surprisingly, Eisenhower narrowly lost Missouri, a bellwether state for most of the 20th century, and which had voted for him in 1952; at the same time he carried Kentucky, Louisiana, and West Virginia, which had voted against him in the previous election. Eisenhower was the first Republican presidential candidate to win Louisiana, and by extension any Deep South state, since 1876.\nThis was the sixth and most recent rematch of an American presidential election, and the second time (after 1900) that the incumbent won a rematch. This was the last election before term limits established by the Twenty-second Amendment to the United States Constitution, which first applied to Eisenhower, became effective. This was the last presidential election before the admissions of Alaska and Hawaii in 1959, as well as the final presidential election in which a major party candidate was born in the 19th century. Eisenhower's victory was the first for an incumbent Republican president since 1924, and he became the first Republican to serve two full terms since Ulysses S. Grant in 1869–1877."