"Presidential elections were held in the United States on November 8, 1960. The Democratic ticket of Senator John F. Kennedy and his running mate, Senate Majority Leader Lyndon B. Johnson, narrowly defeated the Republican ticket of incumbent Vice President Richard Nixon and his running mate, U.N. Ambassador Henry Cabot Lodge Jr. This was the first election in which 50 states participated, marking the first participation of Alaska and Hawaii, and the last in which the District of Columbia did not. It was also the first election in which an incumbent president—in this case, Dwight D. Eisenhower—was ineligible to run for a third term because of the term limits established by the 22nd Amendment.\nNixon faced little opposition in the Republican race to succeed popular incumbent Eisenhower. Kennedy, the junior senator from Massachusetts, established himself as the Democratic frontrunner with his strong performance in the 1960 Democratic primaries, including key victories in Wisconsin and West Virginia over Senator Hubert Humphrey. He defeated Senate Majority Leader Lyndon B. Johnson on the first presidential ballot of the 1960 Democratic National Convention, and asked Johnson to serve as his running mate.\nBoth presidential nominees were relatively youthful, guaranteeing that America would elect its first president born in the 20th century. The 1960 presidential election was one of closest in American history, due to a number of factors: Kennedy benefited from the economic recession of 1957–1958, which hurt the standing of the incumbent Republican Party, and he had the advantage of 17 million more registered Democrats than Republicans. Furthermore, the new votes that Kennedy, a Roman Catholic, gained among Catholics almost neutralized the new votes Nixon gained among Protestants. Nixon's advantages came from Eisenhower's popularity, and the economic prosperity of the past eight years. Kennedy strategically focused on campaigning in populous swing states, while Nixon exhausted time and resources campaigning in all fifty states. Kennedy emphasized his youth, while Nixon focused heavily on his experience. Kennedy relied on Johnson to hold the South, and used television effectively.\nKennedy won 303 to 219 in the Electoral College, and he won the reported national popular vote by 112,827, a margin of 0.17 percent. Fourteen unpledged electors from Mississippi and Alabama cast their votes for Senator Harry F. Byrd, as did a faithless elector from Oklahoma. Kennedy's popular vote margin was the second-narrowest in presidential history, only surpassed by the 0.11% margin of the election of 1880, and the smallest ever for a Democrat (notwithstanding the presidential elections in which the winners lost the popular vote). Kennedy became the youngest person ever elected to the U.S. presidency, at 43 years and 5 months."