"Presidential elections were held in the United States on November 3, 1964, less than a year following the assassination of John F. Kennedy, who won the previous presidential election. Incumbent Democratic President Lyndon B. Johnson defeated Republican Senator Barry Goldwater in a landslide victory. Johnson won 61.1% of the popular vote which, to date, remains the highest popular vote percentage of any candidate since the advent of widespread popular elections in 1824.\nJohnson took office on November 22, 1963, following Kennedy's assassination, and generally continued his policies, except with greater emphasis on civil rights. He easily defeated a primary challenge from segregationist Alabama Governor George Wallace to win the nomination. At the 1964 Democratic National Convention, Johnson selected liberal Minnesota Senator Hubert Humphrey as his running mate. In the narrow Republican contest, conservative Arizona Senator Barry Goldwater defeated liberal New York Governor Nelson Rockefeller and Pennsylvania Governor William Scranton.\nJohnson championed a series of anti-poverty programs, collectively known as the Great Society, and his passage of the Civil Rights Act of 1964. Goldwater espoused a low-tax, small-government philosophy with an aggressive foreign policy. Although he personally opposed segregation and previously supported the Civil Rights Act of 1957 and 1960, Goldwater opposed the Civil Rights Act of 1964, saying it was unconstitutional. Democrats successfully portrayed Goldwater as a dangerous extremist, most infamously in the \"Daisy\" television advertisement. The Republican Party was divided between its moderate and conservative factions, with Rockefeller and other moderate party leaders refusing to campaign for Goldwater. Johnson led by wide margins in all polls during the campaign.\nJohnson became the fourth and most recent vice president to succeed the presidency following the death of his predecessor and win a full term in his own right. Johnson carried 44 states and the District of Columbia, which voted for the first time in this election. Goldwater won his home state and swept the five states of the Deep South, due to the Democratic Party's strong support of civil rights and desegregation. Except for Louisiana, the Deep South states had previously never voted for a Republican presidential candidate since the end of Reconstruction in 1877.\nThis was the last election in which the Democratic Party won a majority of the white vote, with 59% of white voters casting their ballot for Johnson over Goldwater. This was the last election in which the Democratic nominee carried Idaho, Utah, Wyoming, North Dakota, South Dakota, Nebraska, Kansas, or Oklahoma, and the only election ever in which the Democrats carried Alaska. This marked the first presidential election in history in which the Democrats carried Vermont, and conversely, the first in which the Republicans carried Georgia. As of 2024, this marks the last time that a Democratic presidential candidate has won more than 400 electoral votes, as well as 40 or more states.\nThis was also the last election until 1992 in which the Democrats carried California, Colorado, Illinois, Montana, Nevada, New Mexico, New Jersey, New Hampshire, or Vermont, as well as the last election until 2008 in which the Democrats carried Virginia or Indiana. As such, this was the most recent presidential election in which the entire Midwestern region voted Democratic. This is also the only election between 1952 and 1972 in which Richard Nixon did not appear on the Republican ticket.\n\n"