"Presidential elections were held in the United States on November 5, 1968. The Republican nominee, former vice president Richard Nixon, defeated both the Democratic nominee, incumbent vice president Hubert Humphrey, and the American Independent Party nominee, former Alabama governor George Wallace. It is often considered a major realigning election, as it permanently disrupted the Democratic New Deal Coalition that had dominated presidential politics since 1932.\nIncumbent president Lyndon B. Johnson had been the early frontrunner for the Democratic Party's nomination but withdrew from the race after only narrowly winning the New Hampshire primary. Humphrey, Eugene McCarthy, and Robert F. Kennedy emerged as the three major candidates in the Democratic primaries until Kennedy was assassinated in June 1968, part of a streak of high-profile assassinations in the 1960s. Humphrey edged out anti-Vietnam war candidate McCarthy to win the Democratic nomination, sparking numerous anti-war protests. Nixon, who lost in 1960 to John F. Kennedy, entered the Republican primaries as the front-runner, defeating liberal New York governor Nelson Rockefeller, conservative California governor Ronald Reagan, and other candidates to win his party's nomination.\nThe election year was tumultuous and chaotic. It was marked by the assassination of Martin Luther King Jr. in early April, and the subsequent 54 days of riots across the nation; the assassination of Robert F. Kennedy in early June; and widespread opposition to the Vietnam War across university campuses as well as at the Democratic National Convention, which saw widely publicized police crackdowns on protesters, reporters, and bystanders.\nHumphrey's promise to continue the Johnson administration's war on poverty and support for the civil rights movement led to an erosion of Democratic support in the South. This prompted a run by Wallace on the ticket of the newly-formed American Independent Party, which campaigned in favor of racial segregation on the basis of \"states' rights.\" Wallace attracted socially conservative voters throughout the South (including Southern Democrats as well as former Barry Goldwater supporters who preferred Wallace over Nixon), and drew further support from white working-class voters in the Industrial North and Midwest who were attracted to his economic populism and anti-establishment rhetoric.\nNixon, promising to restore law and order to the nation's cities and provide new leadership in the Vietnam War, aimed at attracting a \"silent majority\" of moderate voters  who were alienated by both Humphrey's liberal agenda and Wallace's ultraconservative viewpoints; Nixon also pursued a \"southern strategy\" and employed coded language in the Upper South, where the electorate was less extreme on the segregation issue.\nHumphrey trailed Nixon by wide margins in polls taken during most of the campaign from late August to early October. In the final month of the campaign, Humphrey managed to narrow Nixon's lead after Wallace's candidacy collapsed and Johnson suspended bombing in the Vietnam War to appease the anti-war movement; the election was considered a tossup by election day. Nixon managed to secure a close victory in the popular vote, with just over 500,000 votes (0.7%) separating him and Humphrey. In the Electoral College, Nixon's victory was larger; he carried the tipping point state of Ohio by over 90,000 votes (2.3%), and his overall margin of victory in the Electoral College was 110 votes. Wallace became the most recent third-party candidate (as of 2024) to carry any state in a presidential election. This was the first presidential election after the passage of the Voting Rights Act of 1965, which began restoring voting rights to Black Americans in the South, who had been disenfranchised for decades under Jim Crow.\nThis was the last presidential election until 2024 in which the incumbent president was eligible to run again but was not the eventual nominee of their party. Nixon also became the first non-incumbent vice president to be elected president, something that would not happen again until 2020."