"Presidential elections were held in the United States on November 7, 1972. Incumbent Republican President Richard Nixon defeated Democratic Senator George McGovern in a landslide victory. With 60.7% of the popular vote, Richard Nixon won the largest share of the popular vote for the Republican Party in any presidential election.\nNixon swept aside challenges from two Republican representatives in the Republican primaries to win renomination. McGovern, who had played a significant role in changing the Democratic nomination system after the 1968 U.S. presidential election, mobilized the anti-Vietnam War movement and other liberal supporters to win the Democratic nomination. Among the candidates he defeated were early front-runner Edmund Muskie, 1968 nominee Hubert Humphrey, governor George Wallace, and representative Shirley Chisholm.\nNixon emphasized the strong economy and his success in foreign affairs, while McGovern ran on a platform calling for an immediate end to the Vietnam War and the institution of a guaranteed minimum income. Nixon maintained a large lead in polling. McGovern's general election campaign was damaged by the perception that his platform was radical, and by revelations that his initial running mate, Thomas Eagleton, had undergone electroconvulsive therapy as a treatment for depression; Eagleton was replaced by Sargent Shriver after only nineteen days on the ticket. In June, Nixon's reelection committee broke into the Watergate complex to wiretap the Democratic National Committee's headquarters; early news of the incident had little impact on the success of Nixon's campaign, but further damaging revelations in the ensuing Watergate scandal soon engulfed his second term.\nNixon won the election in a landslide victory, taking 60.7% of the popular vote, carrying 49 states and becoming the first Republican to sweep the South, whereas McGovern took just 37.5% of the popular vote. This marked the most recent time that the Republican nominee carried Minnesota in a presidential election; it also made Nixon the only two-term vice president to be elected president twice. The 1972 election was the first since the ratification of the 26th Amendment, which lowered the voting age from 21 to 18, further expanding the electorate.\nNixon and his vice president Spiro Agnew both resigned from office within two years of the election: Agnew in October 1973 due to a bribery scandal, and Nixon in August 1974 in the face of likely impeachment and conviction as a result of the Watergate scandal. Republican House Minority Leader Gerald Ford, who replaced Agnew as vice president in December 1973 and Nixon as president in August 1974, thus became the only person in American history to attain the presidency without winning an election for president or vice president."