"Presidential elections were held in the United States on November 2, 1976. The Democratic ticket of former Georgia governor Jimmy Carter and his running mate Minnesota senator Walter Mondale, narrowly defeated the Republican ticket of incumbent president Gerald Ford and his running mate Kansas  senator Bob Dole. This was the first presidential election since 1932 in which the incumbent was defeated, as well as the only Democratic victory of the six presidential elections from 1968 to 1988.\nFord ascended to the presidency when Richard Nixon resigned in 1974 in the wake of the Watergate scandal, which badly damaged the Republican Party and its electoral prospects. Ford previously served as Nixon's second vice president after his first vice president, Spiro Agnew, resigned in 1973 for taking bribes while he was the governor of Maryland prior to becoming vice president.\nFord promised to continue Nixon's political agenda and govern as a moderate Republican, causing considerable backlash from the conservative wing of his party. This spurred former California governor Ronald Reagan to mount a significant challenge against him in the Republican primaries, in which Ford narrowly prevailed. Carter was unknown outside of his home state of Georgia at the start of the Democratic primaries, but he emerged as the front-runner after his victories in the first set of primaries. Campaigning as a political moderate within his own party and as a Washington outsider, Carter defeated numerous opponents to clinch the Democratic nomination.\nFord pursued a \"Rose Garden strategy\" in which he sought to portray himself as an experienced leader focused on fulfilling his role as chief executive. On the other hand, Carter emphasized his status as a reformer who was \"untainted\" by Washington. Saddled with a poor economy, the fall of South Vietnam, and the political fallout from the Watergate scandal, including his unpopular pardon of Richard Nixon, Ford trailed by a wide margin in polls taken after Carter's formal nomination in July 1976. Ford's polling rebounded after a strong performance in the first presidential debate, and the race was close on election day.\nCarter won the election with 297 Electoral College votes and took 50.1% of the popular vote. He carried several Midwestern and Northeastern states along with every state in the Deep South, becoming the first Democrat to accomplish this feat since Franklin D. Roosevelt in 1944. Additionally, Carter's narrow victories in Ohio and Wisconsin, which carried a combined 36 electoral votes, were especially crucial to his win. Meanwhile, Ford swept the West Coast and Mountain states and took 48.0% of the popular vote. Ford became the first president ever to fail to win a national election as president or vice president. His loss to Carter was due in part to the backlash against Republican candidates nationwide in the wake of the Watergate scandal, a trend that became apparent in the 1974 elections. \nCarter became the first non-incumbent president representing a Southern state to be elected since Zachary Taylor in 1848. As of 2024, this is the last election in which the Democratic ticket won the majority of states in the South or the states of Alabama, Mississippi, South Carolina, and Texas (mainly due to Carter's southern roots), as well as the most recent election in which the losing candidate carried more states than the winning candidate."