"Presidential elections were held in the United States on November 6, 1984. Incumbent Republican president Ronald Reagan and his running mate, incumbent vice president George H. W. Bush, were reelected to a second term in a landslide. They defeated the Democratic ticket of former vice president Walter Mondale and Congresswoman Geraldine Ferraro.\nReagan and Bush faced only token opposition in their bid for re-nomination. Mondale faced a competitive field in his bid, defeating Colorado senator Gary Hart, activist Jesse Jackson, and several other candidates in the Democratic primaries. He eventually chose New York representative Geraldine Ferraro as his running mate, the first woman to be on a major party's presidential ticket.\nReagan touted a strong economic recovery from the 1970s stagflation and the 1981–1982 recession, and the widespread perception that his presidency had overseen a revival of national confidence and prestige. At 73, Reagan was the oldest person to be nominated by a major party for president, a record that stood until 2020. The Reagan campaign produced effective television advertising and deftly neutralized concerns regarding Reagan's age. Mondale criticized Reagan's supply-side economics and budget deficits. He called for the reduction of U.S. public debt, a nuclear freeze, and ratification of the Equal Rights Amendment.\nReagan won re-election in a landslide victory, carrying 525 electoral votes, 49 states, and 58.8% of the popular vote. Mondale won 13 electoral votes: 10 from his home state of Minnesota, which he won by a narrow margin of 0.18% (3,761 votes), and 3 from the District of Columbia, which has always voted overwhelmingly for the Democratic candidate. Reagan won the second-largest share of the Electoral College since 1820 (second only to Franklin D. Roosevelt in 1936 and the largest for a Republican), and the most raw electoral votes ever received by a candidate. As of 2025, Reagan is the last Republican to sweep all of New England, and this is the last time any candidate won the popular vote by double digits and more than 500 electoral votes."