"Presidential elections were held in the United States on November 8, 1988. The Republican Party's ticket of incumbent Vice President George H. W. Bush and Indiana Senator Dan Quayle defeated the Democratic ticket of Massachusetts Governor Michael Dukakis and Texas Senator Lloyd Bentsen. The election was the third consecutive landslide victory for the Republican Party.\nPresident Ronald Reagan was ineligible to seek a third term because of the 22nd Amendment. As a result, it was the first election since 1968 to lack an incumbent president on the ballot. Bush entered the Republican primaries as the front-runner, defeating Kansas Senator Bob Dole and televangelist Pat Robertson. He selected Indiana Senator Dan Quayle as his running mate. Dukakis, an early Atari Democrat, won the Democratic primaries after Gary Hart (another prominent Atari Democrat, forerunning the New Democrats of the 1990s) withdrew and Ted Kennedy (representing the traditional liberal wing of the Democratic Party) declined to run. He selected Texas Senator Lloyd Bentsen as his running mate.\nBush ran an aggressive campaign that concentrated mainly on the strong economy, reduction in crime, and continuance with Reagan's policies. He attacked Dukakis as an elitist \"Massachusetts liberal\" and soft-on-crime, to which Dukakis ineffectively responded. Despite Dukakis initially leading in the polls, Bush pulled ahead after the Republican National Convention and extended his lead after two strong debate performances. Bush won a decisive victory over Dukakis, winning the Electoral College and the popular vote by sizable margins. Bush became the fourth sitting vice president to be elected president after John Adams in 1796, Thomas Jefferson in 1800, and Martin Van Buren in 1836, and remains the most recent to do so. Despite his loss, Dukakis flipped nine states that had voted Republican in 1984: Hawaii, Iowa, Massachusetts, New York, Oregon, Rhode Island, Washington, West Virginia, and Wisconsin. \nAs of 2024, it remains the most recent election in which a candidate won over 400 electoral votes, as well as 40 or more states. It is also the most recent open seat election in which the incumbent president’s party retained the White House, and the most recent time a party won the presidency for a third consecutive term. Since the death of Jimmy Carter in 2024, this is the earliest election in which at least one of the major party nominees for president (Dukakis) or vice president (Quayle) is still alive.\n\n"