"The 1992 United States presidential election was the presidential election, held in the United States, on November 3, 1992. Democratic governor Bill Clinton of Arkansas defeated incumbent Republican president George H. W. Bush and independent businessman Ross Perot of Texas. The election marked the end of 12 consecutive years of Republican rule of the White House, as well as the end of a longer period of Republican dominance in American presidential politics that began in 1968 to 1988, with exception only in 1976.\nBush had alienated many conservatives in his party by breaking his 1988 campaign pledge not to raise taxes, but he fended off a primary challenge from paleoconservative commentator Pat Buchanan without losing a single contest. Bush's popularity following his success in the Gulf War dissuaded high-profile Democratic candidates such as Mario Cuomo from entering the 1992 Democratic primaries. Clinton, a leader of the centrist Democratic Leadership Council, established himself as the front-runner for the Democratic nomination by sweeping the Super Tuesday primaries. He defeated former governor of California Jerry Brown, former Massachusetts senator Paul Tsongas, and other candidates to win the nomination, and chose Tennessee senator Al Gore as his running mate. The billionaire Perot launched an independent campaign, emphasizing his opposition to the North American Free Trade Agreement and his plan to reduce the national debt.\nThe economy had recovered from a recession in the spring of 1991, followed by 19 consecutive months of growth, but perceptions of the economy's slow growth harmed Bush, for he had inherited a substantial economic boom from his predecessor Ronald Reagan. Bush's greatest strength, foreign policy, was regarded as much less important following the dissolution of the Soviet Union and the end of the Cold War, as well as the relatively peaceful climate in the Middle East after the Gulf War. Perot led in several polls taken in June 1992, but severely damaged his candidacy by temporarily dropping out of the race in July. The Bush campaign criticized Clinton's character and emphasized Bush's foreign policy successes, while Clinton focused on the economy.\nClinton won a plurality in the popular vote and a majority of the electoral vote, breaking a streak of three consecutive Republican victories. Clinton flipped a total of 22 states that had voted Republican in the election of 1988. Perot won 18.9% of the popular vote, the highest share of the vote won by a candidate outside of the two major parties since 1912."