"Presidential elections were held in the United States on November 7, 2000. Republican Governor George W. Bush of Texas, the eldest son of 41st President George H. W. Bush, narrowly defeated incumbent Democratic Vice President Al Gore. It was the fourth of five U.S. presidential elections, and the first since 1888, in which the winning candidate lost the popular vote, and is considered one of the closest U.S. presidential elections in history, with long-standing controversy about the result. \nIncumbent Democratic President Bill Clinton was ineligible to seek a third term because of term limits established by the 22nd Amendment. Incumbent Vice President Gore easily secured the Democratic nomination, defeating former New Jersey Senator Bill Bradley in the primaries. He selected Connecticut Senator Joe Lieberman as his running mate. Bush was seen as the early favorite for the Republican nomination, and after a contentious primary battle with Arizona Senator John McCain and others, he secured the nomination by Super Tuesday. He selected former Secretary of Defense Dick Cheney as his running mate.\nBoth major-party candidates focused primarily on domestic issues, such as the budget, tax relief, and reforms for federal social insurance programs, although foreign policy was not ignored. Due to President Clinton's sex scandal with Monica Lewinsky and subsequent impeachment, Gore avoided campaigning with Clinton. Republicans denounced Clinton's indiscretions, while Gore criticized Bush's lack of experience.\n\nOn election night, it was unclear who had won, with the electoral votes of the state of Florida still undecided. The returns showed that Bush won Florida by such a close margin that state law required a recount. A month-long series of legal battles led to the highly controversial 5–4 U.S. Supreme Court decision Bush v. Gore, which ended the recount. Ultimately, Bush won Florida by 537 votes, a margin of 0.009%. The Florida recount and subsequent litigation resulted in major post-election controversy, with some analysis suggesting that limited county-based recounts would have confirmed a Bush victory, whereas a statewide recount would have given the state to Gore. Post-election analysis found that Palm Beach County's butterfly ballot misdirected over 2,000 votes from Gore to third-party candidate Pat Buchanan, tipping Florida—and the election—to Bush.\nUltimately, Bush won 271 electoral votes, one vote more than the 270 required to win, while Gore won the popular vote by 543,895 votes (a margin of 0.52% of all votes cast). Bush flipped 11 states that had voted Democratic in 1996: Arkansas, Arizona, Florida, Kentucky, Louisiana, Missouri, Nevada, New Hampshire, Ohio, Tennessee, and West Virginia. Despite Gore's loss, this election marked the first time since 1948 that the Democratic Party won the popular vote in three consecutive elections."