"Presidential elections were held in the United States on November 2, 2004. Incumbent Republican President George W. Bush and his running mate, incumbent Vice President Dick Cheney, were re-elected to a second term. They narrowly defeated the Democratic ticket of John Kerry, a senator from Massachusetts, and his running mate John Edwards, a senator from North Carolina.\nBush and Cheney were renominated by their party with no difficulty. Meanwhile, the Democrats engaged in a competitive primary. Kerry emerged as the early-front runner but was faced with serious opposition by former Vermont governor Howard Dean, who briefly surged ahead of Kerry in the polls. Kerry won the first set of primaries in January and re-emerged as the front-runner, and Dean dropped out in February. Kerry clinched his party's nomination in March after a series of primary victories over runner-up Edwards, who he ultimately selected to be his running mate.\nThe September 11 attacks in 2001 decisively reshaped Bush's foreign policy goals and garnered him near-universal support early in his term. However, by 2004 his handling of the war on terror attracted serious debate, particularly over his handling of the 2003 invasion of Iraq. Bush presented himself as a decisive leader and attacked Kerry as a \"flip-flopper\". Kerry criticized Bush's conduct of the Iraq War but he had also voted for it. Domestic issues were debated as well, including the economy and jobs, health care, abortion, same-sex marriage, and embryonic stem cell research.\nBush won by a narrow margin of 35 electoral votes and took 50.7% of the popular vote. Bush swept the South and the Mountain states and took the crucial swing states of Ohio, Iowa, and New Mexico, the last two flipping Republican. Although Kerry flipped New Hampshire, Bush won both more electoral votes and states than in 2000. Ohio was the tipping-point state, and was considered to be the state that allowed Bush to win reelection. Some aspects of the election process were subject to controversy, although not to the degree seen in the 2000 presidential election. Bush won Florida by a 5% margin, a significant improvement over his razor-thin victory margin in the state four years earlier which led to a legal challenge in Bush v. Gore. This remains the most recent presidential election in which the Republican candidate won Colorado, New Mexico, and Virginia.\nAt the time, Bush received the most popular votes in history, a record which would be broken in 2008. Bush's win was the only Republican popular vote victory during the eight elections from 1992 to 2020. As of 2025, Bush is the only Republican president since 1984 to have won re-election to a consecutive second term.\n\n"