"Presidential elections were held in the United States on November 3, 2020. The Democratic ticket of former vice president Joe Biden and Kamala Harris, the junior senator from California, defeated the incumbent Republican president Donald Trump and vice president Mike Pence. The election saw the highest voter turnout by percentage since 1900. Biden received more than 81 million votes, the most votes ever cast for a presidential candidate in U.S. history. \nIn a competitive primary that featured the most candidates for any political party in the modern era of American politics, Biden secured the Democratic presidential nomination. Biden's running mate, Harris, became the first African-American, first Asian-American, and third female vice presidential nominee on a major party ticket. Trump secured re-nomination, getting a total of 2,549 delegates, one of the most in presidential primary history, in the Republican primaries. Jo Jorgensen secured the Libertarian presidential nomination with Spike Cohen as her running mate, and Howie Hawkins secured the Green presidential nomination with Angela Nicole Walker as his running mate.\nThe central issues of the election included the public health and economic impacts of the COVID-19 pandemic; civil unrest in reaction to the police murder of George Floyd, the Supreme Court following the death of Ruth Bader Ginsburg and confirmation of Amy Coney Barrett, and the future of the Affordable Care Act. Due to the ongoing pandemic, a record number of ballots were cast early and by mail. Thirty-eight states had over half of all votes cast using these methods, and only three states had fewer than 25%. As a result of a large number of mail-in ballots, some swing states saw delays in vote counting and reporting; this led to major news outlets delaying their projection of Biden and Harris as the president-elect and vice president-elect until the morning of November 7, 2020.\nBiden achieved victory in the Electoral College, winning 306 electoral votes, while Trump received 232. Trump was the first president to lose re-election since George H. W. Bush in 1992. Key to Biden's victory were his wins in the Democratic-leaning Rust Belt states of Michigan, Pennsylvania, and Wisconsin, which Trump narrowly carried in 2016 and whose combined 46 electoral votes were enough to swing the election to either candidate.  \nBefore, during, and after Election Day, Trump and numerous other Republicans repeatedly made false claims that widespread electoral fraud had occurred and that only he had legitimately won the election. Attorney General William Barr and officials in each of the 50 states found no evidence of fraud (widespread or otherwise) or irregularities in the election. Although most resulting lawsuits were either dismissed or ruled against by numerous courts, Trump nonetheless conspired: 33–53  with his campaign team to submit documents in several states (all of which had been won by Biden) which falsely claimed to be legitimate electoral votes for President Trump and Vice President Mike Pence. After the submission of these documents, the Trump campaign intended that the presiding officer of the United States Senate, either President of the Senate Pence or President pro tempore Chuck Grassley, would claim to have the unilateral power to reject electors during the January 6, 2021 vote counting session; the presiding officer would reject all electors from the several states in which the Trump campaign had submitted false documents, leaving 232 votes for Trump and 222 votes for Biden, thereby overturning the election results in favour of Trump. The plans for January 6 failed to come to fruition after Pence refused to follow the campaign's proposals. Trump nevertheless urged his supporters on January 6, 2021, to march to the Capitol while the joint session of Congress was assembled there to count electoral votes and formalize Biden's victory, leading to hundreds storming the building and interrupting the electoral vote count;: 637–669  as a result, the House impeached Trump for incitement of insurrection on January 13, 2021, making him the only federal officeholder in American history to be impeached twice. The Senate would later acquit him for the second time on February 13, 2021, after he had already left office; while a majority of senators (57-43) voted to convict Trump, this fell short of the two-thirds requirement for removal as required under the United States Constitution. On January 7, Trump acknowledged the incoming administration without mentioning Biden's name. Biden and Harris were inaugurated on January 20, 2021; in a break from tradition, Trump did not attend his successor's inauguration. Trump was indicted in August 2023 on four counts for conspiring to overturn the results. The case was dismissed following Trump's victory in the 2024 presidential election. Trump's actions in the aftermath of the election have been described as an attempted self-coup d'état."