"A presidential election was held in the United States on November 5, 2024. The Republican Party's ticket—Donald Trump, who was the 45th president of the United States from 2017 to 2021, and JD Vance, then-junior U.S. senator from Ohio—defeated the Democratic Party's ticket—Kamala Harris, the incumbent U.S. vice president, and Tim Walz, the 41st governor of Minnesota.\nThe incumbent president, Joe Biden of the Democratic Party, initially ran for re-election as the party's presumptive nominee. However, after a poor debate performance in June intensified concerns about his age and health, Biden ended his re-election campaign on July 21 and endorsed Harris as his successor. Harris was voted the party's nominee by Democratic delegates on August 5. Harris selected Walz as her running mate. The Harris-Walz ticket supported national abortion protections; LGBT rights; housing subsidies; strengthening the Affordable Care Act; banning price gouging; increasing the number of Border Patrol agents; and continued military aid to Ukraine and Israel in their respective wars.\nTrump, who lost the 2020 presidential election to Biden, ran for re-election again. He was shot in the ear in an assassination attempt on July 13, 2024. Trump was nominated as the Republican Party's presidential candidate during the 2024 Republican National Convention alongside his running mate, Vance. The Trump-Vance ticket supported mass deportation of illegal immigrants; an isolationist \"America First\" foreign policy agenda with skepticism of Ukraine and support of Israel; anti-transgender policies; and tariffs. The Trump campaign made many false and misleading statements, including claims of electoral fraud in 2020. Trump's political movement has been described by historians and former Trump administration officials as authoritarian.\nTrump won the Electoral College with 312 electoral votes, while Harris received 226. Trump won every swing state, including the first win of Nevada by Republicans since 2004. Trump won the national popular vote with a plurality of 49.8%, making him the first Republican to win the popular vote since George W. Bush in 2004. Trump became the first president since Grover Cleveland in 1892 to be elected to a non-consecutive second term and the first Republican to be elected to a non-consecutive second term. Analysts attributed the outcome to the 2021–2023 inflation surge, a global anti-incumbent wave, the unpopularity of the Biden administration, Trump's gains with the working class, and the Mexico–United States border crisis.\n\n"